app/helpers/posts_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def author(post)
    @author = User.find_by(id: post.user_id).username if user_signed_in?