app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "first post "], ["body", "this is my first post "], ["user_id", 1], ["created_at", "2021-04-21 21:39:49.115645"], ["updated_at", "2021-04-21 21:39:49.115645"]]